RenBuyi-code/vending-machine-100ch/Code/spring_drive_V1.6/Application/Drivers/Source/swm181_uart_buf.c
/**
*********************************************************************************************************
* @copy
*                                 (c) Copyright 2010-2017
*                                   All Rights Reserved
*
*                                 INTERNAL FILE,DON'T PUBLIC.
*
* <h2><center>&copy; COPYRIGHT hnclcj@hotmail.com </center></h2>
*********************************************************************************************************
* @file      swm181_uart_buf.c
* @history
* @version   V1.0.0
* @date      2018.11.08 把4个中断 统一用一个服务程序实现,
*********************************************************************************************************
*/


#define  UART_GLOBALS
#include <cpu.h>
#include <swm181_uart_buf.h>



#if UART_MODULE_EN > 0






/*********************************************************************************************************
*                                              局 部 常 数
*********************************************************************************************************/

typedef enum _uart_rst_                             // UART FIFO复位
{
    UART_RST_RX   = 1,                              // RX
    UART_RST_TX   = 2,                              // TX
    UART_RST_RXTX = 3,                              // RX+TX
} emUART_RST;

#define UART_TX_BUSY         (TRUE)
#define UART_TX_NO_BUSY      (FALSE)



/*********************************************************************************************************
*                                             模块局部变量
*********************************************************************************************************/

static BOOL     UartUsgFlag[UART_MAX_NUM];          // 串口是否在使用标志






/*********************************************************************************************************
*                                             模块内局部函数
*********************************************************************************************************/

static void  UartRxInBuf     (u8_t port, u8_t Data);
static void  UartTxByte      (u8_t port, u8_t Data);
static void  UartTxInBuf     (u8_t port, u8_t Data);
static u8_t  UartTxOutBuf    (u8_t port);
static void  UartBufFlush    (u8_t port, emUART_RST type);












/**
 *********************************************************************************************************
 * @brief      UART的公用中断处理
 * @param[in]  None
 * @param[out] None
 * @retval     None
 * @par Description
 * @details
 * @note       1. UART0, 2, 3 相同处理
 *             2. UART1 强制转换后相同处理(扩展功能不支持 )
 *********************************************************************************************************
 */

void UartIntProc (u8_t port, UART_TypeDef *UARTx)
{
    stUART_BUF_DEF *p     = NULL;
    stUART_CTRL    *pCtrl = NULL;
    uint32_t chr;


    if(UART_INTRXThresholdStat(UARTx) || UART_INTTimeoutStat(UARTx)) {
        p     = &UartBuf[port].Rx;
        pCtrl = &p->stCtrl;

        while(UART_IsRXFIFOEmpty(UARTx) == 0) {
            if(UART_ReadByte(UARTx, &chr) == 0)	{
                UartRxInBuf(port, chr);                     // 进缓存
            }
        }
    }


    if ( UART_INTTXThresholdStat(UARTx) )	{
        p     = &UartBuf[port].Tx;
        pCtrl = &p->stCtrl;

        while (UART_IsTXFIFOFull(UARTx) == 0) {
            if ( pCtrl->bit.Cnt > 0 ) {                     // 发送缓存有数据 并且发送寄存器为空
                UART_WriteByte(UARTx, UartTxOutBuf(port));  // 读走一个数据到发送寄存器
            } else {
                UART_INTTXThresholdDis(UARTx);              // 禁止发送中断
                pCtrl->bit.TxEn = UART_TX_NO_BUSY;          // 允许后台直接写发送寄存器发送数据
                break;
            }
        }
    }
}


/**
 *********************************************************************************************************
 * @brief      UART0的中断处理
 * @param[in]  None
 * @param[out] None
 * @retval     None
 * @par Description
 * @details
 * @note       None
 *********************************************************************************************************
 */
#if UART0_UNIT_EN > 0

void UART0_Handler  (void)
{
    UartIntProc(0, UART0);                          // 调用公用的UART数据处理函数
}
#endif


/**
 *********************************************************************************************************
 * @brief      UART1的中断处理
 * @param[in]  None
 * @param[out] None
 * @retval     None
 * @par Description
 * @details
 * @note       None
 *********************************************************************************************************
 */
#if UART1_UNIT_EN > 0

void UART1_Handler  (void)
{
    UartIntProc(1, UART1);                          // 调用公用的UART数据处理函数
}
#endif


/**
 *********************************************************************************************************
 * @brief      UART2的中断处理
 * @param[in]  None
 * @param[out] None
 * @retval     None
 * @par Description
 * @details
 * @note       None
 *********************************************************************************************************
 */
#if UART2_UNIT_EN > 0

void UART2_Handler  (void)
{
    UartIntProc(2, UART2);                          // 调用公用的UART数据处理函数
}
#endif


/**
 *********************************************************************************************************
 * @brief      UART2的中断处理
 * @param[in]  None
 * @param[out] None
 * @retval     None
 * @par Description
 * @details
 * @note       None
 *********************************************************************************************************
 */
#if UART2_UNIT_EN > 0

void UART3_Handler  (void)
{
    UartIntProc(3, UART3);                          // 调用公用的UART数据处理函数
}
#endif


/*********************************************************************************************************
* 功 能 : 清空对应端口的变量
* 入 口 : 'port'   串口编号
*         ‘type’ 操作类型 1=RX 2=TX 3=RX+TX
* 返 回 : 无
* 说 明 : 1> TX FIFO 设置标志后 复位完成后会自动清除此标志
*         2> RX FIFO 设置标志后 不会自动复位此标志 需要手工清除
*********************************************************************************************************/

static void  UartBufFlush (u8_t port, emUART_RST type)
{
    stUART_BUF_DEF *p     = NULL;
    stUART_CTRL    *pCtrl = NULL;


    UART_ENTER_CRITICAL();                          // 进入临界

