RenBuyi-code/vending-machine-100ch/Code/spring_drive_V1.6/Application/Drivers/Source/swm181_uart_buf.c
    if ( (type & 0x01) || (type & 0x03) ) {         // RX
        p              = &UartBuf[port].Rx;
        pCtrl          = &p->stCtrl;

        pCtrl->bit.Cnt = 0;                        // 接收缓存数据计数器
        pCtrl->bit.In  = 0;                        // 接收输入索引
        pCtrl->bit.Out = 0;                        // 接收输出索引
    }

    if ( (type & 0x02) || (type & 0x03) ) {         // TX
        p              = &UartBuf[port].Tx;
        pCtrl          = &p->stCtrl;

        pCtrl->bit.Cnt = 0;                        // 接收缓存数据计数器
        pCtrl->bit.In  = 0;                        // 接收输入索引
        pCtrl->bit.Out = 0;                        // 接收输出索引
    }

    UART_EXIT_CRITICAL();                           // 退出临界
}


/*********************************************************************************************************
* 功 能 : 清空对应端口的变量
* 入 口 : 'port'   串口编号
* 返 回 : 无
* 说 明 : 1>RX FIFO 设置标志后 不会自动复位此标志 需要手工清除
*********************************************************************************************************/

void  UartRxBufFlush (u8_t port)
{
    if (port >= UART_MAX_NUM) {                     // 参数检查
        return;                                     // 退出
    }

    UartBufFlush(port, UART_RST_RX);                // 接收缓存
}


/*********************************************************************************************************
* 功 能 : 清空对应端口的变量
* 入 口 : 'port'   串口编号
* 返 回 : 无
* 说 明 : 1> TX FIFO 设置标志后 复位完成后会自动清除此标志
*********************************************************************************************************/

void  UartTxBufFlush (u8_t port)
{
    if (port >= UART_MAX_NUM) {                     // 参数检查
        return;                                     // 退出
    }

    UartBufFlush(port, UART_RST_TX);                // 发送缓存
}


/*********************************************************************************************************
* 功 能 : 对指定端口的发送寄存器写一字节数据
* 入 口 : 'port' 串口编号
*         'Data' 待发送的数据
* 返 回 : 无
* 说 明 : 无
*********************************************************************************************************/

static void  UartTxByte (u8_t port, u8_t Data)
{
    stUART_BUF_DEF *p     = NULL;
    stUART_CTRL    *pCtrl = NULL;


    p              = &UartBuf[port].Tx;
    pCtrl          = &p->stCtrl;
    if ( !pCtrl->bit.bEn ) {
        return;
    }

    switch (port) {                                 //
#if UART0_UNIT_EN > 0
    case 0 :                                        // -- 串口0
        pCtrl->bit.TxEn = UART_TX_BUSY;             // 忙
        UART_INTTXThresholdEn(UART0);               // 使能中断
        UART_WriteByte(UART0, Data);                // 发送出数据
        break;
#endif

#if UART1_UNIT_EN > 0
    case 1 :                                        // -- 串口1
        pCtrl->bit.TxEn = UART_TX_BUSY;             // 忙
        UART_INTTXThresholdEn(UART1);               // 使能中断
        UART_WriteByte(UART1, Data);                // 发送出数据
        break;
#endif

#if UART2_UNIT_EN > 0
    case 2 :                                        // -- 串口2
        pCtrl->bit.TxEn = UART_TX_BUSY;             // 忙
        UART_INTTXThresholdEn(UART2);               // 使能中断
        UART_WriteByte(UART2, Data);                // 发送出数据
        break;
#endif

#if UART3_UNIT_EN > 0
    case 3 :                                        // -- 串口3
        pCtrl->bit.TxEn = UART_TX_BUSY;             // 忙
        UART_INTTXThresholdEn(UART3);               // 使能中断
        UART_WriteByte(UART3, Data);                // 发送出数据
        break;
#endif

    default :
        break;
    }
}


/*********************************************************************************************************
* 功 能 : UART 工作模式配置
* 入 口 : 'port'   串口编号
*         'baud'   波特率 最大波特率为实际硬件能支持的波特率和数据处理能力设置
*         'parity' 奇偶效验 0为不激活奇偶校验 1为
*         'bits'   数据位
*         'stops'  停止位  这里根据bits自行更改为固定模式 为了兼容以后的版本预留
* 返 回 : 1> UART_ERR_NO_ERR  串口设置没有错误
*         2> UART_ERR_ERR     错误的模式
* 说 明 : 无
*********************************************************************************************************/

u8_t  UartCfgPort (u8_t port, u32_t baud, u8_t parity, u8_t bits, u8_t stops)
{
    if (port >= UART_MAX_NUM) {                     // 参数检查
        return (UART_ERR_ERR);                      // 返回失败
    }
    if ( UartUsgFlag[port] ) {                      // 当前串口时候正在使用?
        return (UART_ERR_USE);                      // 是还没初始化端口 返回配置失败
    }
    if ((bits < 8) || (bits > 9)) {                 // 数据位数
        return (UART_ERR_ERR);                      // 错误模式
    }
    if (parity > 3)  {                              // 校验
        return (UART_ERR_ERR);                      // 错误模式
    }
    if ((stops < 1) || (stops > 2)) {               // 停止位
        return (UART_ERR_ERR);                      // 错误模式
    }

    switch (parity) {                               // 校验模式
    case UART_NONE :                                // --不使用奇偶校验
        parity = UART_PARITY_NONE;
        break;
    case UART_ODD :                                 // --奇校验
        parity = UART_PARITY_ODD;
        break;
    case UART_EVEN :                                // --偶校验
        parity = UART_PARITY_EVEN;
        break;
    case UART_ONE :                                 // --强制为1
        parity = UART_PARITY_ONE;
        break;
    case UART_ZERO :                                // --强制为0
        parity = UART_PARITY_ZERO;
        break;
    default :                                       //
        return(UART_ERR_ERR);                       // 错误模式
    }

    switch (bits) {                                 // 设置bits
    case 8 :                                        // 8
        bits = UART_DATA_8BIT;                      // 1
        break;
    case 9 :                                        // 9
        bits = UART_DATA_9BIT;                      // 2
        break;
    default:                                        //
        bits = UART_DATA_8BIT;                      // 1
        return(UART_ERR_ERR);                       // 错误模式
    }

