RenBuyi-code/vending-machine-100ch/Code/spring_drive_V1.6/Application/Drivers/Source/swm181_uart_buf.c
    switch (stops) {                                // 停止位
    case 1 :                                        // --1BIT
        stops = UART_STOP_1BIT;                     // 0
        break;
    case 2 :                                        // --2BIT
        stops = UART_STOP_2BIT;                     // 1
        break;
    default :                                       //
        stops = UART_STOP_1BIT;                     // 0
        return(UART_ERR_ERR);                       // 错误模式
    }

    UART_ENTER_CRITICAL();                              // 进入临界
    UartUsgFlag[port]       = TRUE;                     // 此端口已经配置过

    switch (port) {
#if UART0_UNIT_EN > 0
    case 0 :                                                  // -- 串口0
    {
        UART_InitStructure UART_CFG;


        NVIC_DisableIRQ(IRQn_UART0);                          // 禁止中断

        PORT_Init(UART0_RXD_PORT, UART0_RXD_IO, FUNMUX_UART0_RXD, 1);	// GPIOA.0配置为UART1输入引脚
        PORT_Init(UART0_TXD_PORT, UART0_TXD_IO, FUNMUX_UART0_TXD, 0);	// GPIOA.1配置为UART1输出引脚

        UART_CFG.Baudrate       = baud;
        UART_CFG.DataBits       = bits;
        UART_CFG.Parity         = parity;
        UART_CFG.StopBits       = stops;

        UART_CFG.RXThreshold    = 2;
        UART_CFG.RXThresholdIEn = 1;

        UART_CFG.TXThreshold    = 3;
        UART_CFG.TXThresholdIEn = 0;

        UART_CFG.TimeoutTime    = 2;
        UART_CFG.TimeoutIEn     = 1;

        UART_Init(UART0, &UART_CFG);
        IRQ_Connect(IRQ0_15_UART0, IRQn_UART0, 1);
        UART_Open(UART0);

        NVIC_EnableIRQ(IRQn_UART0);                           // 使能中断
    }
    break;
#endif

#if UART1_UNIT_EN > 0                                         //
    case 1 :                                                  // -- 串口1
    {
        UART_InitStructure UART_CFG;


        NVIC_DisableIRQ(IRQn_UART1);                          // 禁止中断

        PORT_Init(UART1_RXD_PORT, UART1_RXD_IO, FUNMUX_UART1_RXD, 1);   // GPIOB.8配置为UART1输入引脚
        PORT_Init(UART1_TXD_PORT, UART1_TXD_IO, FUNMUX_UART1_TXD, 0);	// GPIOB.9配置为UART1输出引脚

        UART_CFG.Baudrate       = baud;
        UART_CFG.DataBits       = bits;
        UART_CFG.Parity         = parity;
        UART_CFG.StopBits       = stops;

        UART_CFG.RXThreshold    = 2;
        UART_CFG.RXThresholdIEn = 1;

        UART_CFG.TXThreshold    = 3;
        UART_CFG.TXThresholdIEn = 0;

        UART_CFG.TimeoutTime    = 2;
        UART_CFG.TimeoutIEn     = 1;

        UART_Init(UART1, &UART_CFG);
        IRQ_Connect(IRQ0_15_UART1, IRQn_UART1, 1);
        UART_Open(UART1);

        NVIC_EnableIRQ(IRQn_UART1);                           // 使能中断
    }
    break;
#endif

#if UART2_UNIT_EN > 0
    case 2 :                                                  // -- 串口2
    {
        UART_InitStructure UART_CFG;


        NVIC_DisableIRQ(IRQn_UART2);                          // 禁止中断

        PORT_Init(UART2_RXD_PORT, UART2_RXD_IO, FUNMUX_UART2_RXD, 1);	//GPIOB.8配置为UART1输入引脚
        PORT_Init(UART2_TXD_PORT, UART2_TXD_IO, FUNMUX_UART2_TXD, 0);	//GPIOB.9配置为UART1输出引脚

        UART_CFG.Baudrate       = baud;
        UART_CFG.DataBits       = bits;
        UART_CFG.Parity         = parity;
        UART_CFG.StopBits       = stops;

        UART_CFG.RXThreshold    = 2;
        UART_CFG.RXThresholdIEn = 1;

        UART_CFG.TXThreshold    = 3;
        UART_CFG.TXThresholdIEn = 0;

        UART_CFG.TimeoutTime    = 2;
        UART_CFG.TimeoutIEn     = 1;

        UART_Init(UART2, &UART_CFG);
        IRQ_Connect(IRQ0_15_UART2, IRQn_UART2, 1);
        UART_Open(UART2);

        NVIC_EnableIRQ(IRQn_UART2);                           // 使能中断
    }
    break;
#endif

#if UART3_UNIT_EN > 0
    case 3 :                                                  // -- 串口3
    {
        UART_InitStructure UART_CFG;


        NVIC_DisableIRQ(IRQn_UART3);                          // 禁止中断

        PORT_Init(UART3_RXD_PORT, UART3_RXD_IO, FUNMUX_UART3_RXD, 1);	//GPIOB.8配置为UART1输入引脚
        PORT_Init(UART3_TXD_PORT, UART3_TXD_IO, FUNMUX_UART3_TXD, 0);	//GPIOB.9配置为UART1输出引脚

        UART_CFG.Baudrate       = baud;
        UART_CFG.DataBits       = bits;
        UART_CFG.Parity         = parity;
        UART_CFG.StopBits       = stops;

        UART_CFG.RXThreshold    = 2;
        UART_CFG.RXThresholdIEn = 1;

        UART_CFG.TXThreshold    = 3;
        UART_CFG.TXThresholdIEn = 0;

        UART_CFG.TimeoutTime    = 2;
        UART_CFG.TimeoutIEn     = 1;

        UART_Init(UART3, &UART_CFG);
        IRQ_Connect(IRQ0_15_UART3, IRQn_UART3, 1);
        UART_Open(UART3);

        NVIC_EnableIRQ(IRQn_UART3);                           // 使能中断
    }
    break;
#endif

    default :                                                 // -- 串口错误
        UART_EXIT_CRITICAL();                                 // 退出临界
        return UART_ERR_ERR;
    }
    UART_EXIT_CRITICAL();                               // 退出临界

    return (UART_ERR_NONE);                             // 没有错误
}


/*********************************************************************************************************
* 功 能 : 串口关闭
* 入 口 : 'port' 串口号
* 返 回 : 无
* 说 明 : 1> 停止UART中断
*         2> 恢复对应的IO资源为GPIO
*********************************************************************************************************/

void UartClose (u8_t port)
{
    if (port >= UART_MAX_NUM) {                     // 参数检查
        return;                                     // 超过最大串口数据 退出
    }

    UART_ENTER_CRITICAL();                          // 进入临界
    if ( !UartUsgFlag[port] ) {                     // 当前串口时候正在使用?
        UART_EXIT_CRITICAL();                       // 退出临界
        return;                                     // 已经关闭了 直接退出
    }

    UartUsgFlag[port] = FALSE;                      // 设置串口使用标志为未使用

    switch (port) {                                 // -- 根据端口号来处理
#if UART0_UNIT_EN > 0
    case 0 :                                        // -- 串口0
        NVIC_DisableIRQ(IRQn_UART0);                // 禁止中断

        UART_Close(UART0);
        break;
#endif

#if UART1_UNIT_EN > 0                               //
    case 1 :                                        // -- 串口1
        NVIC_DisableIRQ(IRQn_UART1);                // 禁止中断

        UART_Close(UART1);
        break;
#endif

#if UART2_UNIT_EN > 0
    case 2 :                                        // -- 串口2
        NVIC_DisableIRQ(IRQn_UART2);                // 禁止中断

        UART_Close(UART2);
        break;
#endif

#if UART3_UNIT_EN > 0
    case 3 :                                        // -- 串口2
        NVIC_DisableIRQ(IRQn_UART2);                // 禁止中断

