RenBuyi-code/vending-machine-100ch/Code/spring_drive_V1.6/Application/Drivers/Source/swm181_uart_buf.c
        UART_Close(UART3);
        break;
#endif

    default :                                       // -- 串口错误
        break;
    }

    UartBufFlush(port, UART_RST_RXTX);              // 清空端口变量内容(接收/发送)

    UART_EXIT_CRITICAL();                           // 退出临界
}


/*********************************************************************************************************
* 功 能 : 串口读数据
* 入 口 : 'port' 串口编号
*         'err'  返回错误信息的指针
* 返 回 : 1> 读到的数据
*         2> err=UART_RXD_EMPTY 接收缓存没有数据
*         3> err=UART_RXD_OK    正确在接收缓存读到数据
* 说 明 : 1> 在调用此函数前 最好用Uart1RxGetNMsgs函数检查一下接收缓存里面有没有信息
*         2> 如果不按1>的用法用 则要对返回的错误代码分析
*********************************************************************************************************/

u8_t  UartRxGetChar  (u8_t port, u8_t *err)
{
    stUART_BUF_DEF *p     = NULL;
    stUART_CTRL    *pCtrl = NULL;
    u8_t            msg = 0;


    if (port >= UART_MAX_NUM) {                     // 参数检查
        *err = UART_ERR_RXD_EMPTY;                  // 返回代码为接收为空
        return 0;                                   //
    }

    UART_ENTER_CRITICAL();                          // 进入临界
    if ( !UartUsgFlag[port] ) {                     // 参数检查
        *err = UART_ERR_NO_USE;                     // 串口未配置
        UART_EXIT_CRITICAL();                       // 退出临界
        return 0;                                   //
    }

    p     = &UartBuf[port].Rx;                      // 取对应串口缓存
    pCtrl = &p->stCtrl;                             //
    if ( !pCtrl->bit.bEn ) {                        //
        UART_EXIT_CRITICAL();                       // 退出临界
        return 0;                                   //
    }

    if (pCtrl->bit.Cnt > 0) {                       // 检测接收缓存是否有数据
        pCtrl->bit.Cnt--;                           // 有数据计数器减1
        msg = p->pBuf[pCtrl->bit.Out++];            // 取出数据
        if (pCtrl->bit.Out >= p->BufSize) {         // 检查出数据计数器 是否大于最大接收缓存
            pCtrl->bit.Out  = 0;                    // 是复位出数据计数器
        }
        *err = UART_ERR_RXD_NO_ERR;                 // 返回代码为读数据正确
    } else {
        *err = UART_ERR_RXD_EMPTY;                  // 返回代码为接收为空
    }
    UART_EXIT_CRITICAL();                           // 退出临界

    return (msg);                                   //
}


/*********************************************************************************************************
* 功 能 : 串口读N个数据
* 入 口 : 'port' 串口编号
*         'p'    返回数据信息的指针
*         'len'  读的数据长度
* 返 回 : 1> UART_RXD_EMPTY 读数据为空    一般是len为空 或接收缓存中没有数据
*         2> UART_RXD_FALSE 错误读数据    一般为len大于数据接收缓存中的数据
*         3> UART_RXD_OK    数据正确读到
* 说 明 : 1> 对于返回参数2> 可以使用Uart1RxGetNMsgs 先取得缓存中的数据个数再一次读走
*********************************************************************************************************/

u8_t  UartRxGetNChar (u8_t port, u8_t *pRBuf, UART_TYPE len)
{
    stUART_BUF_DEF *p     = NULL;
    stUART_CTRL    *pCtrl = NULL;
    UART_TYPE       i = len;



    if (port >= UART_MAX_NUM) {                     // 参数检查 端口号是否正确
        return 0;                                   // 返回0
    }

    if ( (pRBuf == NULL) || (len == 0) ) {          // 参数检查
        return 0;                                   // 返回0
    }

    UART_ENTER_CRITICAL();                          // 进入临界
    if ( !UartUsgFlag[port] ) {                     // 参数检查 此端口是否已经配置
        UART_EXIT_CRITICAL();                       // 退出临界
        return 0;                                   // 返回0
    }

    p     = &UartBuf[port].Rx;                      // 取对应串口缓存
    pCtrl = &p->stCtrl;                             //
    if ( !pCtrl->bit.bEn ) {                        //
        UART_EXIT_CRITICAL();                       // 退出临界
        return 0;                                   //
    }

    if (pCtrl->bit.Cnt == 0) {                      // 检查数据长度 和接收缓存是否为空
        UART_EXIT_CRITICAL();                       // 退出临界
        return 0;                                   // 返回代码接收数据为0个
    }

    if (len > pCtrl->bit.Cnt) {                     // 检查读数长度跟实际接收缓存数据个数
        i      = pCtrl->bit.Cnt;                    // 只能交给缓存中实际的数据量
        len    = i;                                 // 返回读取到p->Cnt个数据
        pCtrl->bit.Cnt = 0;                         // 缓存中的数据全部交给当前读取了
    } else {
        pCtrl->bit.Cnt = pCtrl->bit.Cnt - len;      //
    }

    while (i--) {                                   // 读走i个数据
        *pRBuf++ = p->pBuf[pCtrl->bit.Out++];       // 取出数据
        if (pCtrl->bit.Out >= p->BufSize) {         // 处理接收出数据计数器
            pCtrl->bit.Out = 0;                     // 复位出数据计数器
        }
    }
    UART_EXIT_CRITICAL();                           // 退出临界

    return (len);                                   // 返回接收到n个数据
}


/*********************************************************************************************************
* 功 能 : 检测接收缓存中的数据个数
* 入 口 : 'port' 串口编号
* 返 回 : 缓存中的数据个数
* 说 明 : 无
*********************************************************************************************************/

UART_TYPE   UartRxGetNMsgs (u8_t port)
{
    stUART_BUF_DEF *p     = NULL;
    stUART_CTRL    *pCtrl = NULL;
    UART_TYPE       cnt = 0;


    if (port >= UART_MAX_NUM) {                     // 参数检查
        return 0;                                   // 返回0
    }

    UART_ENTER_CRITICAL();                          // 进入临界
    if ( !UartUsgFlag[port] ) {                     // 参数检查 此端口是否已经配置
        UART_EXIT_CRITICAL();                       // 退出临界
        return 0;                                   // 返回0
    }

    p     = &UartBuf[port].Rx;                      // 取对应串口缓存
    pCtrl = &p->stCtrl;                             //
    if ( !pCtrl->bit.bEn ) {                        //
        UART_EXIT_CRITICAL();                       // 退出临界
        return 0;                                   //
    }

    cnt = pCtrl->bit.Cnt;                           // 取接收计数器数据
    UART_EXIT_CRITICAL();                           // 退出临界

    return (cnt);                                   // 返回接收缓存计数
}


