RenBuyi-code/vending-machine-100ch/Code/spring_drive_V1.6/Application/Drivers/Source/swm181_uart_buf.c
/*********************************************************************************************************
* 功 能 : 串口接收数据进入缓存
* 入 口 : 'port' 串口号
*         'Data' 待入本地缓存的数据
* 返 回 : 无
* 说 明 : 1> 内部函数 用户禁止调用
*         2> 只在中断中使用 不能使用临界处理函数
*********************************************************************************************************/

static void UartRxInBuf (u8_t port, u8_t Data)
{
    stUART_BUF_DEF *p     = NULL;
    stUART_CTRL    *pCtrl = NULL;


    p     = &UartBuf[port].Rx;                      // 取对应串口缓存
    pCtrl = &p->stCtrl;                             //
    if ( !pCtrl->bit.bEn ) {                        //
        return ;                                    //
    }

    if (pCtrl->bit.Cnt < p->BufSize) {              // 检查缓冲大小
        pCtrl->bit.Cnt++;                           // 接收缓存计数器累加
        p->pBuf[pCtrl->bit.In++] = Data;            // 接收到的数据进缓存
        if (pCtrl->bit.In >= p->BufSize) {          // 处理索引
            pCtrl->bit.In = 0;                      // 进入索引复位
        }
    }
}


/*********************************************************************************************************
* 功 能 : 检测发送缓存中的空闲空间
* 入 口 : 'port' 串口编号
* 返 回 : 缓存中的空闲空间大小
* 说 明 : 无
*********************************************************************************************************/

UART_TYPE  UartTxGetEmptyMsgs (u8_t port)
{
    stUART_BUF_DEF *p     = NULL;
    stUART_CTRL    *pCtrl = NULL;
    UART_TYPE       cnt = 0;


    if (port >= UART_MAX_NUM) {                     // 参数检查
        return 0;                                   // 返回0
    }

    UART_ENTER_CRITICAL();                          // 进入临界
    if ( !UartUsgFlag[port] ) {                     // 参数检查 此端口是否已经配置
        UART_EXIT_CRITICAL();                       // 退出临界
        return 0;                                   // 返回0
    }

    p     = &UartBuf[port].Tx;                      // 取对应串口缓存
    pCtrl = &p->stCtrl;                             //
    if ( !pCtrl->bit.bEn ) {                        //
        UART_EXIT_CRITICAL();                       // 退出临界
        return 0;                                   //
    }

    cnt = p->BufSize - pCtrl->bit.Cnt;              // 取接收计数器数据
    UART_EXIT_CRITICAL();                           // 退出临界

    return (cnt);                                   // 返回接收缓存计数
}


/*********************************************************************************************************
* 功 能 : 检测发送缓存中的数据个数
* 入 口 : 'port' 串口编号
* 返 回 : 缓存中的数据个数
* 说 明 : 无
*********************************************************************************************************/

UART_TYPE  UartTxGetNMsgs (u8_t port)
{
    stUART_BUF_DEF *p     = NULL;
    stUART_CTRL    *pCtrl = NULL;
    UART_TYPE       cnt = 0;


    if (port >= UART_MAX_NUM) {                     // 参数检查
        return 0;                                   // 返回0
    }

    UART_ENTER_CRITICAL();                          // 进入临界
    if ( !UartUsgFlag[port] ) {                     // 参数检查 此端口是否已经配置
        UART_EXIT_CRITICAL();                       // 退出临界
        return 0;                                   // 返回0
    }

    p     = &UartBuf[port].Tx;                      // 取对应串口缓存
    pCtrl = &p->stCtrl;                             //
    if ( !pCtrl->bit.bEn ) {                        //
        UART_EXIT_CRITICAL();                       // 退出临界
        return 0;                                   //
    }

    cnt = pCtrl->bit.Cnt;                           // 取接收计数器数据
    UART_EXIT_CRITICAL();                           // 退出临界

    return (cnt);                                   // 返回接收缓存计数
}


/*********************************************************************************************************
* 功 能 : 串口发送不了的数据进入缓存
* 入 口 : 'port' 串口编号
*         'Data' 进入缓存的消息数据
* 返 回 : 1> UART_TXD_FLOODL 发送消息进入缓存满 (失败)
*         2> UART_TXD_OK   发送消息进入缓存OK
* 说 明 : 1> 内部模式 用户不能调用
*********************************************************************************************************/

static void UartTxInBuf (u8_t port, u8_t Data)
{
    stUART_BUF_DEF *p     = NULL;
    stUART_CTRL    *pCtrl = NULL;


    p     = &UartBuf[port].Tx;                      // 取对应串口缓存
    pCtrl = &p->stCtrl;                             //
    if ( !pCtrl->bit.bEn ) {                        //
        return ;                                    // 发送特征值
    }

    if (pCtrl->bit.Cnt < p->BufSize) {              // 处理发送缓存计数器
        pCtrl->bit.Cnt++;                           // 发送缓存计数器加1
        p->pBuf[pCtrl->bit.In++] = Data;            // 来不及发送的数据进发送缓存
        if (pCtrl->bit.In >= p->BufSize) {          // 处理发送进缓存计数器
            pCtrl->bit.In = 0;                      // 复位发送进缓存计数器
        }
    }
}


/*********************************************************************************************************
* 功 能 : 得到指定端口线发送状态
* 入 口 : 'port' 串口编号
* 返 回 : 1> FALSE 写满
*         2> TRUE 为空
* 说 明 : 1> 内部模式 用户不能调用
*********************************************************************************************************/

//static BOOL  UartTxLsrSts (u8_t port)
//{
//    u32_t LSRValue = 0;


//    switch (port) {
//#if UART0_UNIT_EN > 0
//    case 0 :
//        LSRValue = UART_IsTXBusy(UART0);
//        break;
//#endif

//#if UART1_UNIT_EN > 0
//    case 1 :
//        LSRValue = UART_IsTXBusy(UART1);
//        break;
//#endif

//#if UART2_UNIT_EN > 0
//    case 2 :
//        LSRValue = UART_IsTXBusy(UART2);
//        break;
//#endif

//#if UART3_UNIT_EN > 0
//    case 3 :
//        LSRValue = UART_IsTXBusy(UART3);
//        break;
//#endif

//    default :
//        break;
//    }

//    return ((LSRValue==0) ? (FALSE) : (TRUE));
//}


/*********************************************************************************************************
* 功 能 : 串口缓存中取数据发送
* 入 口 : 'port' 串口编号
*         'Data' 进入缓存的消息数据
* 返 回 : 1> UART_TXD_FLOODL 发送消息进入缓存满 (失败)
*         2> UART_TXD_OK   发送消息进入缓存OK
* 说 明 : 1> 内部模式 用户不能调用
*********************************************************************************************************/

static u8_t UartTxOutBuf (u8_t port)
{
    stUART_BUF_DEF *p     = NULL;
    stUART_CTRL    *pCtrl = NULL;
    u8_t            temp;


    p     = &UartBuf[port].Tx;                      // 取对应串口缓存
    pCtrl = &p->stCtrl;                             //
    if ( !pCtrl->bit.bEn ) {                        //
        return 0xAA;                                // 发送特征值
    }

