RenBuyi-code/vending-machine-100ch/Code/spring_drive_V1.6/Application/Drivers/Source/swm181_uart_buf.c
    pCtrl->bit.Cnt--;                               // 发送缓存计数器减一
    temp = p->pBuf[pCtrl->bit.Out++];
    if (pCtrl->bit.Out >= p->BufSize) {
        pCtrl->bit.Out = 0;
    }

    return temp;
}



/*********************************************************************************************************
* 功 能 : 串口发送1 BYTE数据
* 入 口 : 'port' 串口编号
*         'Date' 发送的数据
* 返 回 : 1> UART_TXD_OK    发送数据OK
*         2> UART_TXD_FALSE 发送失败   一般是发送缓存已满
* 说 明 : 1> SBUF发送寄存器为空时直接把要发送的数据放到发送缓存
*         2> SBUF发送寄存器为忙时来不及发的数据进入到发送缓存
*         3> 发送缓存满时直接返回发送失败
*********************************************************************************************************/

u8_t UartTxPutChar (u8_t port, u8_t Data)
{
    stUART_BUF_DEF *p     = NULL;
    stUART_CTRL    *pCtrl = NULL;


    if (port >= UART_MAX_NUM) {                     // 参数检查
        return UART_ERR_TXD_FALSE;                  // 返回0
    }

    UART_ENTER_CRITICAL();                          // 进入临界
    if (!UartUsgFlag[port]) {                       // 参数检查
        UART_EXIT_CRITICAL();                       // 退出临界
        return UART_ERR_TXD_FALSE;                  // 返回0
    }

    p = &UartBuf[port].Tx;                          // 取对应串口缓存
    pCtrl = &p->stCtrl;                             //
    if ( !pCtrl->bit.bEn ) {                        //
        UART_EXIT_CRITICAL();                       // 退出临界
        return (UART_ERR_TXD_FALSE);                //
    }

    if ( !pCtrl->bit.TxEn ) {                       // 判断串口是否可以直接发送数据
        UartTxByte(port, Data);                     // 发送出数据
        UART_EXIT_CRITICAL();                       // 退出临界
        return (UART_ERR_TXD_NO_ERR);               // 返回代码为发送OK
    }

    if (pCtrl->bit.Cnt >= p->BufSize) {             // 判断发送缓存计数器是否为最大发送缓存
        UART_EXIT_CRITICAL();                       // 是退出临界 不处理
        return (UART_ERR_TXD_FALSE);                // 发送缓存满 返回代码为发送失败
    } else {
        UartTxInBuf(port, Data);                    // 来不及发送的数据一直等到进入发送缓存
        UART_EXIT_CRITICAL();                       // 退出临界
        return (UART_ERR_TXD_NO_ERR);               // 返回代码为发送OK
    }
}


/**
 ********************************************************************************************************
 * @brief      UART1 发送N BYTE数据
 * @param[in]  'port' 串口编号
*              'pBuf' 指向发送消息的指针
*              'len'  发送数据的长度
 * @param[out] None
 * @retval     实际已经发送的数据长度
 * @par Description
 * @details
 * @note       返回实际发送数据的长度 对剩下的字节 就需要用户自己处理
 ********************************************************************************************************
 */

UART_TYPE UartTxPutNChar (u8_t port, u8_t *pWBuf, UART_TYPE len)
{
    stUART_BUF_DEF *p     = NULL;
    stUART_CTRL    *pCtrl = NULL;
    UART_TYPE       i = 0;


    if (port >= UART_MAX_NUM) {                     // 参数检查
        return 0;                                   // 返回0
    }

    if ( (pWBuf == NULL) || (len == 0) ) {          // 参数检查
        return 0;                                   // 返回0
    }

    UART_ENTER_CRITICAL();                          // 进入临界
    if (!UartUsgFlag[port]) {                       // 参数检查
        UART_EXIT_CRITICAL();
        return 0;                                   // 返回0
    }

    p     = &UartBuf[port].Tx;                      // 取对应串口缓存
    pCtrl = &p->stCtrl;
    if ( !pCtrl->bit.bEn ) {                        // 没有使能
        UART_EXIT_CRITICAL();                       // 退出临界
        return 0;                                   // 退出发送
    }

    i   = p->BufSize - pCtrl->bit.Cnt;              // 剩下的发送缓存长度
    if (i == 0) {                                   // 还有剩余空间？
        UART_EXIT_CRITICAL();                       // 没有退出临界
        return 0;                                   // 返回0
    }
    i   = (i >= len) ? (len) : (i);                 // 处理实际发送数据长度
    len = i;                                        // 实际已经发送的数据长度

    while (i--) {                                   // 发送数据处理
        if ( !pCtrl->bit.TxEn ) {                   // 检测直接发送条件
            UartTxByte(port, *pWBuf);               // 发送数据
        } else {                                    // 理解下面的指令实际就是变相的while(!TI)
            UartTxInBuf(port, *pWBuf);              // 发送不了的数据进入发送缓存
        }
        pWBuf++;                                    // 指针处理
    }
    UART_EXIT_CRITICAL();                           // 退出临界

    return (len);                                   // 返回实际已经发送的数据长度
}



/**
 ********************************************************************************************************
 * @brief      初始化串口的各种变量
 * @param[in]  None
 * @param[out] None
 * @retval     None
 * @par Description
 * @details
 * @note
 ********************************************************************************************************
 */

void UartInit (void)
{
    stUART_CTRL *pCtrl = NULL;
    stUART_BUF  *p     = NULL;
    int         i;


    for (i=0; i<UART_MAX_NUM; i++) {                // 复位基本参数
        p                  = &UartBuf[i];           // 取控制变量

        p->Rx.stCtrl.value = 0;                     // 接收控制值
        p->Tx.stCtrl.value = 0;                     // 发送控制值

        UartUsgFlag[i]     = FALSE;                 //
    }


#if UART0_UNIT_EN > 0                               // - uart0
    p               = &UartBuf[0];

#if UART0_RXD_EN > 0
    pCtrl           = &p->Rx.stCtrl;
    pCtrl->bit.bEn  = TRUE;

    p->Rx.pBuf      = Uart0RxBuf;
    p->Rx.BufSize   = UART0_RXD_BUF_SIZE;
#endif

#if UART0_TXD_EN > 0
    pCtrl           = &p->Tx.stCtrl;
    pCtrl->bit.bEn  = TRUE;
    pCtrl->bit.TxEn = UART_TX_NO_BUSY;

    p->Tx.pBuf      = Uart0TxBuf;
    p->Tx.BufSize   = UART0_TXD_BUF_SIZE;
#endif

#endif


#if UART1_UNIT_EN > 0                               // - uart1
    p               = &UartBuf[1];

#if UART1_RXD_EN > 0
    pCtrl           = &p->Rx.stCtrl;
    pCtrl->bit.bEn  = TRUE;

    p->Rx.pBuf      = Uart1RxBuf;
    p->Rx.BufSize   = UART1_RXD_BUF_SIZE;
#endif

#if UART1_TXD_EN > 0
    pCtrl           = &p->Tx.stCtrl;
    pCtrl->bit.bEn  = TRUE;
    pCtrl->bit.TxEn = UART_TX_NO_BUSY;

    p->Tx.pBuf      = Uart1TxBuf;
    p->Tx.BufSize   = UART1_TXD_BUF_SIZE;
#endif

#endif


#if UART2_UNIT_EN > 0                               // - uart2
    p               = &UartBuf[2];

#if UART2_RXD_EN > 0
    pCtrl           = &p->Rx.stCtrl;
    pCtrl->bit.bEn  = TRUE;

    p->Rx.pBuf      = Uart2RxBuf;
    p->Rx.BufSize   = UART2_RXD_BUF_SIZE;
#endif

#if UART2_TXD_EN > 0
    pCtrl           = &p->Tx.stCtrl;
    pCtrl->bit.bEn  = TRUE;
    pCtrl->bit.TxEn = UART_TX_NO_BUSY;

    p->Tx.pBuf      = Uart2TxBuf;
    p->Tx.BufSize   = UART2_TXD_BUF_SIZE;
#endif

#endif


#if UART3_UNIT_EN > 0                               // - uart3
    p               = &UartBuf[3];

#if UART3_RXD_EN > 0
    pCtrl           = &p->Rx.stCtrl;
    pCtrl->bit.bEn  = TRUE;

    p->Rx.pBuf      = Uart3RxBuf;
    p->Rx.BufSize   = UART3_RXD_BUF_SIZE;
#endif

#if UART3_TXD_EN > 0
    pCtrl           = &p->Tx.stCtrl;
    pCtrl->bit.bEn  = TRUE;
    pCtrl->bit.TxEn = UART_TX_NO_BUSY;

    p->Tx.pBuf      = Uart3TxBuf;
    p->Tx.BufSize   = UART3_TXD_BUF_SIZE;
#endif

#endif
}



#endif // UART_MODULE_EN
/*********************************************************************************************************
*                                             End Of File
*********************************************************************************************************/
